OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/n32g020xx_stdperiph_driver/include/n32g020xx_iom.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g020xx_iom.h
 * @author Nations Solution Team
 * @version v1.0.0
 * @brief IO管理模块接口声明文件。
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 * 
 * @defgroup IOM IOM管理模块
 * @{
 */
#ifndef __N32G020XX_IOM_H__
#define __N32G020XX_IOM_H__
//------------------------------------------------------------------
//                        Headers
//------------------------------------------------------------------
#include "n32g020xx.h"
#include "n32g020xx_common.h"

//------------------------------------------------------------------
//                        Definitions
//------------------------------------------------------------------
#define IOM_SET_REG_MSK_VAL(reg, msk, val) SET_REG_BIT_MSK(reg, val, msk)

#define GPIO_MODE (0)

/******  GPIO0_Ctrl *********************************************************/
/*!< GPIO0 Mode Definition */
#define GPIO0_GPIO (GPIO_MODE)
#define GPIO0_PWM0 (1)
#define GPIO0_TM0_CH (2)
#define GPIO0_UART0_TX (3)
/*!< GPIO0 Mode Configuration */
#define IOM_Gpio0ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR1, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO1_Ctrl *********************************************************/
/*!< GPIO1 Mode Definition */
#define GPIO1_GPIO (GPIO_MODE)
#define GPIO1_PWM1 (1)
#define GPIO1_TM1_CH (2)
#define GPIO1_UART0_RX (3)
/*!< GPIO1 Mode Configuration */
#define IOM_Gpio1ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR1, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO2_Ctrl *********************************************************/
/*!< GPIO2 Mode Definition */
#define GPIO2_GPIO (GPIO_MODE)
#define GPIO2_PWM2 (1)
#define GPIO2_TM2_CH (2)
#define GPIO2_UART1_TX (3)
/*!< GPIO2 Mode Configuration */
#define IOM_Gpio2ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR2, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO3_Ctrl *********************************************************/
/*!< GPIO3 Mode Definition */
#define GPIO3_GPIO (GPIO_MODE)
#define GPIO3_PWM3 (1)
#define GPIO3_TM3_CH (2)
#define GPIO3_UART1_RX (3)
/*!< GPIO3 Mode Configuration */
#define IOM_Gpio3ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR2, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO4_Ctrl *********************************************************/
/*!< GPIO4 Mode Definition */
#define GPIO4_GPIO (GPIO_MODE)
#define GPIO4_PWM4 (1)
#define GPIO4_TM4_CH (2)
#define GPIO4_UART2_TX (3)
/*!< GPIO4 Mode Configuration */
#define IOM_Gpio4ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR3, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO5_Ctrl *********************************************************/
/*!< GPIO5 Mode Definition */
#define GPIO5_GPIO (GPIO_MODE)
#define GPIO5_PWM5 (1)
#define GPIO5_SCD_RST (2)
#define GPIO5_SCC_RST (3)
#define GPIO5_UART2_RX (4)
/*!< GPIO5 Mode Configuration */
#define IOM_Gpio5ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR3, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO6_Ctrl *********************************************************/
/*!< GPIO6 Mode Definition */
#define GPIO6_GPIO (GPIO_MODE)
#define GPIO6_PWM6 (1)
#define GPIO6_ADC_IN0 (7)
/*!< GPIO6 Mode Configuration */
#define IOM_Gpio6ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR4, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO7_Ctrl *********************************************************/
/*!< GPIO7 Mode Definition */
#define GPIO7_GPIO (GPIO_MODE)
#define GPIO7_PWM7 (1)
#define GPIO7_ADC_IN1 (7)
/*!< GPIO7 Mode Configuration */
#define IOM_Gpio7ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR4, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO8_Ctrl *********************************************************/
/*!< GPIO8 Mode Definition */
#define GPIO8_GPIO (GPIO_MODE)
#define GPIO8_SPIM0_CLK (1)
#define GPIO8_SPIS0_CLK (2)
#define GPIO8_ADC_IN2 (7)
/*!< GPIO8 Mode Configuration */
#define IOM_Gpio8ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR5, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO9_Ctrl *********************************************************/
/*!< GPIO9 Mode Definition */
#define GPIO9_GPIO (GPIO_MODE)
#define GPIO9_SPIM0_CSN (1)
#define GPIO9_SPIS0_CSN (2)
#define GPIO9_ADC_IN3 (7)
/*!< GPIO9 Mode Configuration */
#define IOM_Gpio9ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR5, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO10_Ctrl *********************************************************/
/*!< GPIO10 Mode Definition */
#define GPIO10_GPIO (GPIO_MODE)
#define GPIO10_SPIM0_MOSI (1)
#define GPIO10_SPIS0_MISO (2)
#define GPIO10_ADC_IN4 (7)
/*!< GPIO10 Mode Configuration */
#define IOM_Gpio10ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR6, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO11_Ctrl *********************************************************/
/*!< GPIO11 Mode Definition */
#define GPIO11_GPIO (GPIO_MODE)
#define GPIO11_SPIM0_MISO (1)
#define GPIO11_SPIS0_MOSI (2)
#define GPIO11_ADC_IN5 (7)
/*!< GPIO11 Mode Configuration */
#define IOM_Gpio11ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR6, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO12_Ctrl *********************************************************/
/*!< GPIO12 Mode Definition */
#define GPIO12_GPIO (GPIO_MODE)
#define GPIO12_SPIM0_IO2 (1)
#define GPIO12_UART1_RTS (2)
#define GPIO12_TM0_CH (3)
#define GPIO12_ADC_IN6 (7)
/*!< GPIO12 Mode Configuration */
#define IOM_Gpio12ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR7, (BIT2 | BIT1 | BIT0), mode)

