OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/n32g020xx_stdperiph_driver/include/n32g020xx_iom.h
/******  GPIO13_Ctrl *********************************************************/
/*!< GPIO13 Mode Definition */
#define GPIO13_GPIO (GPIO_MODE)
#define GPIO13_SPIM0_IO3 (1)
#define GPIO13_UART1_CTS (2)
#define GPIO13_TM1_CH (3)
#define GPIO13_ADC_IN7 (7)
/*!< GPIO13 Mode Configuration */
#define IOM_Gpio13ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR7, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO14_Ctrl *********************************************************/
/*!< GPIO14 Mode Definition */
#define GPIO14_GPIO (GPIO_MODE)
#define GPIO14_SPIM1_CLK (1)
#define GPIO14_SPIS1_CLK (2)
/*!< GPIO14 Mode Configuration */
#define IOM_Gpio14ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR8, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO15_Ctrl *********************************************************/
/*!< GPIO15 Mode Definition */
#define GPIO15_GPIO (GPIO_MODE)
#define GPIO15_SPIM1_CSN (1)
#define GPIO15_SPIS1_CSN (2)
#define GPIO15_COMP_OUT (3)
/*!< GPIO15 Mode Configuration */
#define IOM_Gpio15ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR8, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO16_Ctrl *********************************************************/
/*!< GPIO16 Mode Definition */
#define GPIO16_GPIO (GPIO_MODE)
#define GPIO16_SPIM1_MISO (1)
#define GPIO16_SPIS1_MOSI (2)
/*!< GPIO16 Mode Configuration */
#define IOM_Gpio16ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR9, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO17_Ctrl *********************************************************/
/*!< GPIO17 Mode Definition */
#define GPIO17_GPIO (GPIO_MODE)
#define GPIO17_SPIM1_MOSI (1)
#define GPIO17_SPIS1_MISO (2)
#define GPIO17_USBPHY_COMP_OUT (3)
/*!< GPIO17 Mode Configuration */
#define IOM_Gpio17ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR9, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO18_Ctrl *********************************************************/
/*!< GPIO18 Mode Definition */
#define GPIO18_GPIO (GPIO_MODE)
#define GPIO18_I2C0_MS_CLK (1)
#define GPIO18_TM2_CH (2)
#define GPIO18_UART1_TX (3)
#define GPIO18_ADUSBRXDP_TEST_OUT (4)
#define GPIO18_12MCRYSTAL_TEST_OUT (5)
/*!< GPIO18 Mode Configuration */
#define IOM_Gpio18ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR10, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO19_Ctrl *********************************************************/
/*!< GPIO19 Mode Definition */
#define GPIO19_GPIO (GPIO_MODE)
#define GPIO19_I2C0_MS_DA (1)
#define GPIO19_UART1_RX (3)
#define GPIO19_TM3_CH (4)
#define GPIO19_ADUSBRXDM_TEST_OUT (5)
#define GPIO19_XO32K_RC32K_TEST_OUT (6)
/*!< GPIO19 Mode Configuration */
#define IOM_Gpio19ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR10, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO20_Ctrl *********************************************************/
/*!< GPIO20 Mode Definition */
#define GPIO20_GPIO (GPIO_MODE)
#define GPIO20_I2C1_MS_CLK (1)
#define GPIO20_UART2_TX (3)
#define GPIO20_XIN_12M (7)
/*!< GPIO20 Mode Configuration */
#define IOM_Gpio20ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR11, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO21_Ctrl *********************************************************/
/*!< GPIO21 Mode Definition */
#define GPIO21_GPIO (GPIO_MODE)
#define GPIO21_I2C1_MS_DA (1)
#define GPIO21_UART2_RX (3)
#define GPIO21_XOUT_12M (7)
/*!< GPIO21 Mode Configuration */
#define IOM_Gpio21ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR11, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO22_Ctrl *********************************************************/
/*!< GPIO22 Mode Definition */
#define GPIO22_GPIO (GPIO_MODE)
#define GPIO22_UART0_TX (1)
#define GPIO22_SCD_CLK (2)
#define GPIO22_SCC_CLK (3)
/*!< GPIO22 Mode Configuration */
#define IOM_Gpio22ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR12, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO23_Ctrl *********************************************************/
/*!< GPIO23 Mode Definition */
#define GPIO23_GPIO (GPIO_MODE)
#define GPIO23_SCD_SIO (1)
#define GPIO23_SCC_SIO (2)
#define GPIO23_UART0_RX (3)
/*!< GPIO23 Mode Configuration */
#define IOM_Gpio23ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR12, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO24_Ctrl *********************************************************/
/*!< GPIO24 Mode Definition */
#define GPIO24_GPIO (GPIO_MODE)
#define GPIO24_UART0_RTS (1)
#define GPIO24_TM4_CH (2)
#define GPIO24_CHECK_SCDCARD_INSERT_IN (3)
#define GPIO24_ADC_IN8 (7)
/*!< GPIO24 Mode Configuration */
#define IOM_Gpio24ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR13, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO25_Ctrl *********************************************************/
/*!< GPIO25 Mode Definition */
#define GPIO25_GPIO (GPIO_MODE)
#define GPIO25_UART0_CTS (1)
#define GPIO25_SCD_RST (2)
#define GPIO25_SCC_RST (3)
#define GPIO25_ADC_IN9 (7)
/*!< GPIO25 Mode Configuration */
#define IOM_Gpio25ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR13, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO26_Ctrl *********************************************************/
/*!< GPIO26 Mode Definition */
#define GPIO26_GPIO (GPIO_MODE)
#define GPIO26_COMP_P (7)
/*!< GPIO26 Mode Configuration */
#define IOM_Gpio26ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR14, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO27_Ctrl *********************************************************/
/*!< GPIO27 Mode Definition */
#define GPIO27_GPIO (GPIO_MODE)
#define GPIO27_COMP_M (7)
/*!< GPIO27 Mode Configuration */
#define IOM_Gpio27ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR14, (BIT5 | BIT4 | BIT3), (mode << 3))

/******  GPIO28_Ctrl *********************************************************/
/*!< GPIO28 Mode Definition */
#define GPIO28_GPIO (GPIO_MODE)
#define GPIO28_SCD_CLK (1)
#define GPIO28_SCC_CLK (2)
#define GPIO28_I2C1_MS_CLK (3)
#define GPIO28_ADC_VREF_POSITIVE (7)
/*!< GPIO28 Mode Configuration */
#define IOM_Gpio28ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR15, (BIT2 | BIT1 | BIT0), mode)

/******  GPIO29_Ctrl *********************************************************/
/*!< GPIO29 Mode Definition */
#define GPIO29_GPIO (GPIO_MODE)
#define GPIO29_SCD_SIO (1)
#define GPIO29_SCC_SIO (2)
#define GPIO29_I2C1_MS_DA (3)
#define GPIO29_ADC_VREF_NEGATIVE (7)
/*!< GPIO29 Mode Configuration */
#define IOM_Gpio29ConfigMode(mode) IOM_SET_REG_MSK_VAL(IOM->CR15, (BIT5 | BIT4 | BIT3), (mode << 3))

