OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/n32g020xx_stdperiph_driver/include/n32g020xx_iom.h
/******  PWM *********************************************************/
#define IOM_ConfigGpio0Pwm0Out() IOM_Gpio0ConfigMode(GPIO0_PWM0)
#define IOM_ConfigGpio1Pwm1Out() IOM_Gpio1ConfigMode(GPIO1_PWM1)
#define IOM_ConfigGpio2Pwm2Out() IOM_Gpio2ConfigMode(GPIO2_PWM2)
#define IOM_ConfigGpio3Pwm3Out() IOM_Gpio3ConfigMode(GPIO3_PWM3)
#define IOM_ConfigGpio4Pwm4Out() IOM_Gpio4ConfigMode(GPIO4_PWM4)
#define IOM_ConfigGpio5Pwm5Out() IOM_Gpio5ConfigMode(GPIO5_PWM5)
#define IOM_ConfigGpio6Pwm6Out() IOM_Gpio6ConfigMode(GPIO6_PWM6)
#define IOM_ConfigGpio7Pwm7Out() IOM_Gpio7ConfigMode(GPIO7_PWM7)

/******  TIMER *********************************************************/

/******  Timer0 *********************************************************/
#define IOM_ConfigGpio0Tm0ChIn() IOM_Gpio0ConfigMode(GPIO0_TM0_CH)
#define IOM_ConfigGpio12Tm0ChIn() IOM_Gpio12ConfigMode(GPIO12_TM0_CH)
/******  Timer1 *********************************************************/
#define IOM_ConfigGpio1Tm1ChIn() IOM_Gpio1ConfigMode(GPIO1_TM1_CH)
#define IOM_ConfigGpio13Tm1ChIn() IOM_Gpio13ConfigMode(GPIO13_TM1_CH)
/******  Timer2 *********************************************************/
#define IOM_ConfigGpio2Tm2ChIn() IOM_Gpio2ConfigMode(GPIO2_TM2_CH)
#define IOM_ConfigGpio18Tm2ChIn() IOM_Gpio18ConfigMode(GPIO18_TM2_CH)
/******  Timer3 *********************************************************/
#define IOM_ConfigGpio3Tm3ChIn() IOM_Gpio3ConfigMode(GPIO3_TM3_CH)
#define IOM_ConfigGpio19Tm3ChIn() IOM_Gpio19ConfigMode(GPIO19_TM3_CH)
/******  Timer4 *********************************************************/
#define IOM_ConfigGpio4Tm4ChIn() IOM_Gpio4ConfigMode(GPIO4_TM4_CH)
#define IOM_ConfigGpio24Tm4ChIn() IOM_Gpio24ConfigMode(GPIO24_TM4_CH)

/******  UART *********************************************************/

/******  UART0 *********************************************************/
#define IOM_ConfigGpio0Uart0Tx() IOM_Gpio0ConfigMode(GPIO0_UART0_TX)
#define IOM_ConfigGpio1Uart0Rx() IOM_Gpio1ConfigMode(GPIO1_UART0_RX)
#define IOM_ConfigGpio22Uart0Tx() IOM_Gpio22ConfigMode(GPIO22_UART0_TX)
#define IOM_ConfigGpio23Uart0Rx() IOM_Gpio23ConfigMode(GPIO23_UART0_RX)
#define IOM_ConfigGpio24Uart0RtsOutput() IOM_Gpio24ConfigMode(GPIO24_UART0_RTS)
#define IOM_ConfigGpio25Uart0CtsInput() IOM_Gpio25ConfigMode(GPIO25_UART0_CTS)
/*!< UART0_Rxd Source Definition */
#define UART0_RXD_SRC_ADCOMP (1) // the highest priority
#define UART0_RXD_SRC_USBRXD (2)
#define UART0_RXD_SRC_GPIO1 (3)
#define UART0_RXD_SRC_GPIO23 (0)
/*!< UART0_Rxd Source Configuration */
#define IOM_UART0RxdConfigSrc(src) IOM_SET_REG_MSK_VAL(IOM->CR12, (BIT7 | BIT6), (src << 6))
/*!< IOM_UART0RX Configuration */
#define IOM_UART0RX_EnableWakeUp() (SET_REG_BIT(IOM->WUENC, BIT0))
#define IOM_UART0RX_DisableWakeUp() (CLR_REG_BIT(IOM->WUENC, BIT0))

/******  UART1 *********************************************************/
#define IOM_ConfigGpio2Uart1Tx() IOM_Gpio2ConfigMode(GPIO2_UART1_TX)
#define IOM_ConfigGpio3Uart1Rx() IOM_Gpio3ConfigMode(GPIO3_UART1_RX)
#define IOM_ConfigGpio18Uart1Tx() IOM_Gpio18ConfigMode(GPIO18_UART1_TX)
#define IOM_ConfigGpio19Uart1Rx() IOM_Gpio19ConfigMode(GPIO19_UART1_RX)
#define IOM_ConfigGpio12Uart1RtsOut() IOM_Gpio12ConfigMode(GPIO12_UART1_RTS)
#define IOM_ConfigGpio13Uart1CtsIn() IOM_Gpio13ConfigMode(GPIO13_UART1_CTS)
/*!< IOM_UART1RX Configuration */
#define IOM_UART1RX_EnableWakeUp() (SET_REG_BIT(IOM->WUENC, BIT1))
#define IOM_UART1RX_DisableWakeUp() (CLR_REG_BIT(IOM->WUENC, BIT1))

/******  UART2 *********************************************************/
#define IOM_ConfigGpio4Uart2Tx() IOM_Gpio4ConfigMode(GPIO4_UART2_TX)
#define IOM_ConfigGpio5Uart2Rx() IOM_Gpio5ConfigMode(GPIO5_UART2_RX)
#define IOM_ConfigGpio20Uart2Tx() IOM_Gpio20ConfigMode(GPIO20_UART2_TX)
#define IOM_ConfigGpio21Uart2Rx() IOM_Gpio21ConfigMode(GPIO21_UART2_RX)
/******  UART2_Rxd_Ctrl
 * *********************************************************/
/*!< UART2_Rxd Source Definition */
#define UART2_RXD_SRC_ADCOMP (1) // the highest priority
#define UART2_RXD_SRC_USBRXD (2)
#define UART2_RXD_SRC_GPIO5 (3)
#define UART2_RXD_SRC_GPIO21 (0)
/*!< UART2_Rxd Source Configuration */
#define IOM_UART2RxdConfigSrc(src) IOM_SET_REG_MSK_VAL(IOM->CR11, (BIT7 | BIT6), (src << 6))
/*!< IOM_UART2RX Configuration */
#define IOM_UART2RX_EnableWakeUp() (SET_REG_BIT(IOM->WUENC, BIT2))
#define IOM_UART2RX_DisableWakeUp() (CLR_REG_BIT(IOM->WUENC, BIT2))

/******  SCD *********************************************************/
#define IOM_ConfigGpio5ScdRstIn() IOM_Gpio5ConfigMode(GPIO5_SCD_RST)
#define IOM_ConfigGpio25ScdRstIn() IOM_Gpio25ConfigMode(GPIO25_SCD_RST)
#define IOM_ConfigGpio22ScdClkIn() IOM_Gpio22ConfigMode(GPIO22_SCD_CLK)
#define IOM_ConfigGpio28ScdClkIn() IOM_Gpio28ConfigMode(GPIO28_SCD_CLK)
#define IOM_ConfigGpio23ScdSio() IOM_Gpio23ConfigMode(GPIO23_SCD_SIO)
#define IOM_ConfigGpio29ScdSio() IOM_Gpio29ConfigMode(GPIO29_SCD_SIO)
#define IOM_ConfigGpio24ScdCardInsertCheckIn() IOM_Gpio24ConfigMode(GPIO24_CHECK_SCDCARD_INSERT_IN)
/*!< IOM_SCDRST Configuration */
#define IOM_SCDRST_EnableIntPosEdge() (SET_REG_BIT(IOM->INTPEGD, BIT6))
#define IOM_SCDRST_DisableIntPosEdge() (CLR_REG_BIT(IOM->INTPEGD, BIT6))
#define IOM_SCDRST_EnableIntNegEdge() (SET_REG_BIT(IOM->INTNEGD, BIT6))
#define IOM_SCDRST_DisableIntNegEdge() (CLR_REG_BIT(IOM->INTNEGD, BIT6))
#define IOM_SCDRST_ClearIntPosState() (SET_REG_VAL(IOM->INTSTATD, BIT7))
#define IOM_SCDRST_GetIntPosState() (GET_REG_BIT(IOM->INTSTATD, BIT7))
#define IOM_SCDRST_ClearIntNegState() (SET_REG_VAL(IOM->INTSTATD, BIT6))
#define IOM_SCDRST_GetIntNegState() (GET_REG_BIT(IOM->INTSTATD, BIT6))
#define IOM_SCDRST_EnableWakeUp() (SET_REG_BIT(IOM->WUENC, BIT6))
#define IOM_SCDRST_DisableWakeUp() (CLR_REG_BIT(IOM->WUENC, BIT6))
#define IOM_SCDRST_SetWakeUpHighLevel() (SET_REG_BIT(IOM->WUENC, BIT0))
#define IOM_SCDRST_SetWakeUpLowLevel() (CLR_REG_BIT(IOM->WUENC, BIT0))
#define IOM_SCDRST_GetLevel() (GET_REG_BIT(IOM->GPIODRD, BIT6))
/*!< IOM_SCDPLUG Configuration */
#define IOM_SCDPLUG_EnableIntPosEdge() (SET_REG_BIT(IOM->INTPEGD, BIT7))
#define IOM_SCDPLUG_DisableIntPosEdge() (CLR_REG_BIT(IOM->INTPEGD, BIT7))
#define IOM_SCDPLUG_EnableIntNegEdge() (SET_REG_BIT(IOM->INTNEGD, BIT7))
#define IOM_SCDPLUG_DisableIntNegEdge() (CLR_REG_BIT(IOM->INTNEGD, BIT7))
#define IOM_SCDPLUG_ClearIntPosState() (SET_REG_VAL(IOM->INTSTATE, BIT1))
#define IOM_SCDPLUG_GetIntPosState() (GET_REG_BIT(IOM->INTSTATE, BIT1))
#define IOM_SCDPLUG_ClearIntNegState() (SET_REG_VAL(IOM->INTSTATE, BIT0))
#define IOM_SCDPLUG_GetIntNegState() (GET_REG_BIT(IOM->INTSTATE, BIT0))
#define IOM_SCDPLUG_EnableWakeUp() (SET_REG_BIT(IOM->WUEND, BIT2))
#define IOM_SCDPLUG_DisableWakeUp() (CLR_REG_BIT(IOM->WUEND, BIT2))
#define IOM_SCDPLUG_SetWakeUpHighLevel() (SET_REG_BIT(IOM->WUENC, BIT1))
#define IOM_SCDPLUG_SetWakeUpLowLevel() (CLR_REG_BIT(IOM->WUENC, BIT1))
#define IOM_SCDPLUG_GetLevel() (GET_REG_BIT(IOM->GPIODRD, BIT7))
/*!< IOM_SCDUNPLUG Configuration */
#define IOM_SCDUNPLUG_EnableWakeUp() (SET_REG_BIT(IOM->WUEND, BIT3))
#define IOM_SCDUNPLUG_DisableWakeUp() (CLR_REG_BIT(IOM->WUEND, BIT3))
#define IOM_SCDUNPLUG_SetWakeUpHighLevel() (SET_REG_BIT(IOM->WUENC, BIT2))
#define IOM_SCDUNPLUG_SetWakeUpLowLevel() (CLR_REG_BIT(IOM->WUENC, BIT2))
/*!< IOM_SCDSIO Configuration */
#define IOM_SCDSIO_EnableWakeUp() (SET_REG_BIT(IOM->WUENC, BIT5))
#define IOM_SCDSIO_DisableWakeUp() (CLR_REG_BIT(IOM->WUENC, BIT5))

