OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/n32g020xx_stdperiph_driver/include/n32g020xx_iom.h
/******  SCC *********************************************************/
#define IOM_ConfigGpio5SccRstOut() IOM_Gpio5ConfigMode(GPIO5_SCC_RST)
#define IOM_ConfigGpio25SccRstOut() IOM_Gpio25ConfigMode(GPIO25_SCC_RST)
#define IOM_ConfigGpio22SccClkOut() IOM_Gpio22ConfigMode(GPIO22_SCC_CLK)
#define IOM_ConfigGpio28SccClkOut() IOM_Gpio28ConfigMode(GPIO28_SCC_CLK)
#define IOM_ConfigGpio23SccSio() IOM_Gpio23ConfigMode(GPIO23_SCC_SIO)
#define IOM_ConfigGpio29SccSio() IOM_Gpio29ConfigMode(GPIO29_SCC_SIO)

/******  ADC *********************************************************/
#define IOM_ConfigGpio6AdcIn0() IOM_Gpio6ConfigMode(GPIO6_ADC_IN0)
#define IOM_ConfigGpio7AdcIn1() IOM_Gpio7ConfigMode(GPIO7_ADC_IN1)
#define IOM_ConfigGpio8AdcIn2() IOM_Gpio8ConfigMode(GPIO8_ADC_IN2)
#define IOM_ConfigGpio9AdcIn3() IOM_Gpio9ConfigMode(GPIO9_ADC_IN3)
#define IOM_ConfigGpio10AdcIn4() IOM_Gpio10ConfigMode(GPIO10_ADC_IN4)
#define IOM_ConfigGpio11AdcIn5() IOM_Gpio11ConfigMode(GPIO11_ADC_IN5)
#define IOM_ConfigGpio12AdcIn6() IOM_Gpio12ConfigMode(GPIO12_ADC_IN6)
#define IOM_ConfigGpio13AdcIn7() IOM_Gpio13ConfigMode(GPIO13_ADC_IN7)
#define IOM_ConfigGpio24AdcIn8() IOM_Gpio24ConfigMode(GPIO24_ADC_IN8)
#define IOM_ConfigGpio25AdcIn9() IOM_Gpio25ConfigMode(GPIO25_ADC_IN9)
#define IOM_ConfigGpio28AdcVrefPositive() IOM_Gpio28ConfigMode(GPIO28_ADC_VREF_POSITIVE)
#define IOM_ConfigGpio29AdcVrefNegative() IOM_Gpio29ConfigMode(GPIO29_ADC_VREF_NEGATIVE)

/******  SPIM *********************************************************/

/******  SPIM0 *********************************************************/
#define IOM_ConfigGpio8Spim0ClkOut() IOM_Gpio8ConfigMode(GPIO8_SPIM0_CLK)
#define IOM_ConfigGpio9Spim0CsnOut() IOM_Gpio9ConfigMode(GPIO9_SPIM0_CSN)
#define IOM_ConfigGpio10Spim0MOSI() IOM_Gpio10ConfigMode(GPIO10_SPIM0_MOSI)
#define IOM_ConfigGpio11Spim0MISO() IOM_Gpio11ConfigMode(GPIO11_SPIM0_MISO)
#define IOM_ConfigGpio12Spim0IO2() IOM_Gpio12ConfigMode(GPIO12_SPIM0_IO2)
#define IOM_ConfigGpio13Spim0IO3() IOM_Gpio13ConfigMode(GPIO13_SPIM0_IO3)

/******  SPIM1 *********************************************************/
#define IOM_ConfigGpio14Spim1ClkOut() IOM_Gpio14ConfigMode(GPIO14_SPIM1_CLK)
#define IOM_ConfigGpio15Spim1CsnOut() IOM_Gpio15ConfigMode(GPIO15_SPIM1_CSN)
#define IOM_ConfigGpio16Spim1MISO() IOM_Gpio16ConfigMode(GPIO16_SPIM1_MISO)
#define IOM_ConfigGpio17Spim1MOSI() IOM_Gpio17ConfigMode(GPIO17_SPIM1_MOSI)

/******  SPIS *********************************************************/

/******  SPIS0 *********************************************************/
#define IOM_ConfigGpio8Spis0ClkIn() IOM_Gpio8ConfigMode(GPIO8_SPIS0_CLK)
#define IOM_ConfigGpio9Spis0CsnIn() IOM_Gpio9ConfigMode(GPIO9_SPIS0_CSN)
#define IOM_ConfigGpio10Spis0MISO() IOM_Gpio10ConfigMode(GPIO10_SPIS0_MISO)
#define IOM_ConfigGpio11Spis0MOSI() IOM_Gpio11ConfigMode(GPIO11_SPIS0_MOSI)
/*!< IOM_SPIS0CSN Configuration */
#define IOM_SPIS0CSN_EnableWakeUp() (SET_REG_BIT(IOM->WUENC, BIT3))
#define IOM_SPIS0CSN_DisableWakeUp() (CLR_REG_BIT(IOM->WUENC, BIT3))

/******  SPIS1 *********************************************************/
#define IOM_ConfigGpio14Spis1ClkIn() IOM_Gpio14ConfigMode(GPIO14_SPIS1_CLK)
#define IOM_ConfigGpio15Spis1CsnIn() IOM_Gpio15ConfigMode(GPIO15_SPIS1_CSN)
#define IOM_ConfigGpio16SPis1MOSI() IOM_Gpio16ConfigMode(GPIO16_SPIS1_MOSI)
#define IOM_ConfigGpio17Spis1MISO() IOM_Gpio17ConfigMode(GPIO17_SPIS1_MISO)
/*!< IOM_SPIS1CSN Configuration */
#define IOM_SPIS1CSN_EnableWakeUp() (SET_REG_BIT(IOM->WUENC, BIT4))
#define IOM_SPIS1CSN_DisableWakeUp() (CLR_REG_BIT(IOM->WUENC, BIT4))

/******  I2C *********************************************************/

/******  I2C0 *********************************************************/
#define IOM_ConfigGpio18I2c0MSClk() IOM_Gpio18ConfigMode(GPIO18_I2C0_MS_CLK)
#define IOM_ConfigGpio19I2c0MSDa() IOM_Gpio19ConfigMode(GPIO19_I2C0_MS_DA)
/*!< I2C0SDA WakeUp Configuration */
#define IOM_I2C0SDA_EnableWakeUp() (SET_REG_BIT(IOM->WUEND, BIT0))
#define IOM_I2C0SDA_DisableWakeUp() (CLR_REG_BIT(IOM->WUEND, BIT0))

/******  I2C1 *********************************************************/
#define IOM_ConfigGpio20I2c1MSClk() IOM_Gpio20ConfigMode(GPIO20_I2C1_MS_CLK)
#define IOM_ConfigGpio28I2c1MSClk() IOM_Gpio28ConfigMode(GPIO28_I2C1_MS_CLK)
#define IOM_ConfigGpio21I2c1MSDa() IOM_Gpio21ConfigMode(GPIO21_I2C1_MS_DA)
#define IOM_ConfigGpio29I2c1MSDa() IOM_Gpio29ConfigMode(GPIO29_I2C1_MS_DA)
/*!< I2C1SDA WakeUp Configuration */
#define IOM_I2C1SDA_EnableWakeUp() (SET_REG_BIT(IOM->WUEND, BIT1))
#define IOM_I2C1SDA_DisableWakeUp() (CLR_REG_BIT(IOM->WUEND, BIT1))

/******  Xin/Xout *********************************************************/
#define IOM_ConfigGpio20Xin12M() IOM_Gpio20ConfigMode(GPIO20_XIN_12M)
#define IOM_ConfigGpio21Xout12M() IOM_Gpio21ConfigMode(GPIO21_XOUT_12M)

/******  Comparator *********************************************************/
#define IOM_ConfigGpio15CompOut() IOM_Gpio15ConfigMode(GPIO15_COMP_OUT)
#define IOM_ConfigGpio17UsbphyCompOut() IOM_Gpio17ConfigMode(GPIO17_USBPHY_COMP_OUT)
#define IOM_ConfigGpio26CompP() IOM_Gpio26ConfigMode(GPIO26_COMP_P)
#define IOM_ConfigGpio27CompM() IOM_Gpio27ConfigMode(GPIO27_COMP_M)

/******  For Test *********************************************************/
#define IOM_ConfigGpio18AdUsbRxDpTestOut() IOM_Gpio18ConfigMode(GPIO18_ADUSBRXDP_TEST_OUT)
#define IOM_ConfigGpio19AdUsbRxDmpTestOut() IOM_Gpio19ConfigMode(GPIO19_ADUSBRXDM_TEST_OUT)
#define IOM_ConfigGpio1812MTestOut() IOM_Gpio18ConfigMode(GPIO18_12MCRYSTAL_TEST_OUT)
#define IOM_ConfigGpio19Xo32KRc32KTestOut() IOM_Gpio19ConfigMode(GPIO19_XO32K_RC32K_TEST_OUT)

#define IOM_EnableRcvOut() SET_REG_BIT(IOM->CRTST1, BIT0)  // 使能后，Comparator输出到GPIO19
#define IOM_DisableRcvOut() CLR_REG_BIT(IOM->CRTST1, BIT0) // Comparator输出禁止
// GPIO19需设置为输出模式，sel为0，选中Crysta,32K，sel为1，选中RC32K
#define IOM_Clk32KSrc(sel) IOM_SET_REG_MSK_VAL(IOM->CRTST1, BIT1, ((sel & 0x01UL) << 0x01UL))
#define IOM_EnableDivDll48MOut() SET_REG_BIT(IOM->CRTST1, BIT2)  // 使能后，Dll48M 4分频输出到GPIO10
#define IOM_DisableDivDll48MOut() CLR_REG_BIT(IOM->CRTST1, BIT2) // Dll48M 4分频输出禁止
#define IOM_EnableUsb300MOut() SET_REG_BIT(IOM->CRTST1, BIT3)  // 使能后，300MHz（分频到1MHz）输出到GPIO22
#define IOM_DisableUsb300MOut() CLR_REG_BIT(IOM->CRTST1, BIT3) // 300MHz（分频到1MHz）输出禁止
#define IOM_EnableOcpFlag()                                                                                            \
    SET_REG_BIT(IOM->CRTST1, BIT4)) // 使能后，Adocp_flag_33ext输出到GPIO22
#define IOM_DisableOcpFlag()                                                                                           \
    CLR_REG_BIT(IOM->CRTST1, BIT4)) // Adocp_flag_33ext输出禁止
#define IOM_EnableOsc80MDivOut() SET_REG_BIT(IOM->CRTST1, BIT5)  // 使能后，Osc80M分频输出到GPIO22
#define IOM_DisableOsc80MDivOut() CLR_REG_BIT(IOM->CRTST1, BIT5) // Osc80M分频输出禁止

//------------------------------------------------------------------
//                        TypeDefs
//------------------------------------------------------------------
typedef enum
{
    IOM_SUCCESS  = 0, ///< 操作成功
    IOM_GPIO_ERR = 1, ///< GPIO超出范围
} IOM_ERROR_CODE;

