OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/n32g020xx_stdperiph_driver/include/n32g020xx_iom.h
typedef enum
{
    GPIO0 = 0,
    GPIO1,
    GPIO2,
    GPIO3,
    GPIO4,
    GPIO5,
    GPIO6,
    GPIO7,
    GPIO8,
    GPIO9,
    GPIO10,
    GPIO11,
    GPIO12,
    GPIO13,
    GPIO14,
    GPIO15,
    GPIO16,
    GPIO17,
    GPIO18,
    GPIO19,
    GPIO20,
    GPIO21,
    GPIO22,
    GPIO23,
    GPIO24,
    GPIO25,
    GPIO26,
    GPIO27,
    GPIO28,
    GPIO29,
} IOM_GPIO;

typedef enum
{
    PADS_DRV_4500uA  = 0,
    PADS_DRV_9000uA  = 1,
    PADS_DRV_13500uA = 2,
    PADS_DRV_18000uA = 3,
} IOM_PADS_DRV_CAPA;

//------------------------------------------------------------------
//                        Exported variables
//------------------------------------------------------------------

//------------------------------------------------------------------
//                        Exported functions
//------------------------------------------------------------------
/**
 * @brief GPIO正沿中断触发开关函数
 *
 * @param GPIOx 支持GPIO0~29
 * @param enable 0：正沿中断禁止，其他：正沿中断使能
 */
void IOM_ConfigGpioIntPosEdge(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO负沿中断触发开关函数
 *
 * @param GPIOx 支持GPIO0~29
 * @param enable 0：负沿中断禁止，其他：负沿中断使能
 */
void IOM_ConfigGpioIntNegEdge(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO中断状态清除函数
 *
 * @param GPIOx 支持GPIO0~29
 */
void IOM_ClearGpioIntState(IOM_GPIO GPIOx);

/**
 * @brief GPIO中断状态获取函数
 *
 * @param GPIOx 支持GPIO0~29
 * @param state 输出GPIOx的中断状态
 */
void IOM_GetGpioIntStat(IOM_GPIO GPIOx, uint32_t* state);

/**
 * @brief GPIO唤醒开关函数
 * 
 * @param GPIOx 支持GPIO0~15
 * @param enable 0：GPIO唤醒禁止，其他：GPIO唤醒使能
 * @return IOM_SUCCESS ：成功，IOM_GPIO_ERR ：GPIO超出范围
 */
uint32_t IOM_ConfigGpioWakeUp(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO唤醒电平配置函数
 * 
 * @param GPIOx 支持GPIO0~15
 * @param level 0：低电平，其他：高电平
 * @return IOM_SUCCESS ：成功，IOM_GPIO_ERR ：GPIO超出范围
 */
uint32_t IOM_SetGpioWakeUpLevel(IOM_GPIO GPIOx, uint32_t level);

/**
 * @brief GPIO功能配置函数
 *
 * @param GPIOx 支持GPIO0~29
 */
void IOM_ConfigGpioMode(IOM_GPIO GPIOx);

/**
 * @brief GPIO输出电平配置函数
 *
 * @param GPIOx 支持GPIO0~29
 * @param level 0：低电平，其他：高电平
 */
void IOM_SetGpioLevel(IOM_GPIO GPIOx, uint32_t level);

/**
 * @brief GPIO电平状态获取函数
 *
 * @param GPIOx 支持GPIO0~29
 * @param level 输出GPIOx电平状态
 */
void IOM_GetGpioLevel(IOM_GPIO GPIOx, uint32_t* level);

/**
 * @brief GPIO输出开关函数
 * 
 * @param GPIOx 支持GPIO0~29
 * @param enable 0：GPIO输出禁止，其他：GPIO输出使能
 */
void IOM_ConfigGpioOut(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO输入开关函数
 * 
 * @param GPIOx 支持GPIO0~29
 * @param enable 0：GPIO输入禁止，其他：GPIO输入使能
 */
void IOM_ConfigGpioIn(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO上拉开关函数
 *
 * @param GPIOx 支持GPIO0~29
 * @param enable 0：GPIO上拉禁止，其他：GPIO上拉使能
 */
void IOM_ConfigGpioPullUp(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO下拉开关函数
 * 
 * @param GPIOx 支持GPIO0~29
 * @param enable 0：GPIO下拉禁止，其他：GPIO下拉使能
 */
void IOM_ConfigGpioPullDown(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO SMT开关函数
 * 
 * @param GPIOx 支持GPIO0~29
 * @param enable 0：GPIO SMT禁止，其他：GPIO SMT使能
 */
void IOM_ConfigGpioSmt(IOM_GPIO GPIOx, uint32_t enable);

/**
 * @brief GPIO驱动能力配置函数
 * 
 * @param GPIOx 支持GPIO0~29
 * @param val 四选一，0：驱动能力4.5mA，1：驱动能力9mA，2：驱动能力13.5mA，3：驱动能力18mA
 */
void IOM_ConfigGpioPinDrvCapa(IOM_GPIO GPIOx, IOM_PADS_DRV_CAPA val);

/**
 * @brief PWM紧急停车输入源配置函数
 * 
 * @param GPIOx 支持GPIO14~18和GPIO20~23
 * @return IOM_SUCCESS ：成功，IOM_GPIO_ERR ：GPIO超出范围
 */
uint32_t IOM_SetPwmEmergencyStopSrc(IOM_GPIO GPIOx);

#endif // __N32G020XX_IOM_H__

/** @} */
